<script setup lang="ts">
const breadcrumbsList = [
	{ title: 'Главная', href: '/' },
	{ title: 'Каталог', href: '/catalog' },
	{ title: 'Холодное водоснабжение', href: '/solution' },
]
const servicesList = [
	{
		title: ['Нанесение ППМ изоляции на стальную трубу'],
		content: {
			desc: 'Для надземной прокладки теплотрасс и промышленных сетей. Обеспечивает высокую механическую прочность и стойкость к внешним воздействиям.',
			measures: [
				{
					title: 'Толщина изоляции:',
					value: '10-100',
				},
				{
					title: 'd оболочки:',
					value: '30-140',
				},
				{
					title: 'Срок годности:',
					value: '20 лет',
				},
			],
		},
	},
	{
		title: [
			'Нанесение ППМ изоляции на трубу напорную из полиэтилена повышенной термостойкости ПИКПАЙП PE-RT',
		],
		content: {
			desc: 'Для надземной прокладки теплотрасс и промышленных сетей. Обеспечивает высокую механическую прочность и стойкость к внешним воздействиям.',
			measures: [
				{
					title: 'Толщина изоляции:',
					value: '10-100',
				},
				{
					title: 'd оболочки:',
					value: '30-140',
				},
				{
					title: 'Срок годности:',
					value: '20 лет',
				},
			],
		},
	},
]
const constructionSlides = [
	{
		image: {
			src: 'construction-bg',
			alt: 'Конструкция',
		},
		description:
			'Наружный слой синего цвета производится из ПЭ 100-RC. Упрощает контроль повреждений трубы, а также предотвращает разрушение трубы, вызванное развитием царапин, задиров и иных повреждений внешней поверхности.',
		points: [
			{
				title: 'Описание краткое на пару предложений к картинке',
				top: '65%',
				left: '23%',
			},
			{
				title: 'Описание краткое на пару предложений к картинке',
				top: '57%',
				left: '68%',
			},
			{
				title: 'Описание краткое на пару предложений к картинке',
				top: '28.5%',
				left: '71%',
			},
		],
	},
	{
		image: {
			src: 'construction-bg',
			alt: 'Конструкция',
		},
		description:
			'Наружный слой синего цвета производится из ПЭ 100-RC. Упрощает контроль повреждений трубы, а также предотвращает разрушение трубы, вызванное развитием царапин, задиров и иных повреждений внешней поверхности. 1',
		points: [
			{
				title: 'Описание краткое на пару предложений к картинке',
				top: '45%',
				left: '23%',
			},
			{
				title: 'Описание краткое на пару предложений к картинке',
				top: '77%',
				left: '68%',
			},
			{
				title: 'Описание краткое на пару предложений к картинке',
				top: '18.5%',
				left: '71%',
			},
		],
	},
	{
		image: {
			src: 'construction-bg',
			alt: 'Конструкция',
		},
		description:
			'Наружный слой синего цвета производится из ПЭ 100-RC. Упрощает контроль повреждений трубы, а также предотвращает разрушение трубы, вызванное развитием царапин, задиров и иных повреждений внешней поверхности. 2',
		points: [
			{
				title: 'Описание краткое на пару предложений к картинке',
				top: '65%',
				left: '23%',
			},
			{
				title: 'Описание краткое на пару предложений к картинке',
				top: '57%',
				left: '68%',
			},
			{
				title: 'Описание краткое на пару предложений к картинке',
				top: '28.5%',
				left: '71%',
			},
		],
	},
]

const constructionSliders = [
	{
		button: 'Cпособ 1',
		slides: [
			{
				image: {
					src: 'construction-bg',
					alt: 'Конструкция',
				},
				description:
					'Наружный слой синего цвета производится из ПЭ 100-RC. Упрощает контроль повреждений трубы, а также предотвращает разрушение трубы, вызванное развитием царапин, задиров и иных повреждений внешней поверхности.',
				points: [
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '65%',
						left: '23%',
					},
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '57%',
						left: '68%',
					},
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '28.5%',
						left: '71%',
					},
				],
			},
			{
				image: {
					src: 'construction-bg',
					alt: 'Конструкция',
				},
				description:
					'Наружный слой синего цвета производится из ПЭ 100-RC. Упрощает контроль повреждений трубы, а также предотвращает разрушение трубы, вызванное развитием царапин, задиров и иных повреждений внешней поверхности. 1',
				points: [
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '45%',
						left: '23%',
					},
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '77%',
						left: '68%',
					},
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '18.5%',
						left: '71%',
					},
				],
			},
			{
				image: {
					src: 'construction-bg',
					alt: 'Конструкция',
				},
				description:
					'Наружный слой синего цвета производится из ПЭ 100-RC. Упрощает контроль повреждений трубы, а также предотвращает разрушение трубы, вызванное развитием царапин, задиров и иных повреждений внешней поверхности. 2',
				points: [
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '65%',
						left: '23%',
					},
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '57%',
						left: '68%',
					},
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '28.5%',
						left: '71%',
					},
				],
			},
		],
	},
	{
		button: 'Cпособ 2',
		slides: [
			{
				image: {
					src: 'construction-bg',
					alt: 'Конструкция',
				},
				description:
					'Наружный слой синего цвета производится из ПЭ 100-RC. Упрощает контроль повреждений трубы, а также предотвращает разрушение трубы, вызванное развитием царапин, задиров и иных повреждений внешней поверхности. 3',
				points: [
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '65%',
						left: '23%',
					},
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '57%',
						left: '68%',
					},
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '28.5%',
						left: '71%',
					},
				],
			},
			{
				image: {
					src: 'construction-bg',
					alt: 'Конструкция',
				},
				description:
					'Наружный слой синего цвета производится из ПЭ 100-RC. Упрощает контроль повреждений трубы, а также предотвращает разрушение трубы, вызванное развитием царапин, задиров и иных повреждений внешней поверхности. 4',
				points: [
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '45%',
						left: '23%',
					},
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '77%',
						left: '68%',
					},
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '18.5%',
						left: '71%',
					},
				],
			},
			{
				image: {
					src: 'construction-bg',
					alt: 'Конструкция',
				},
				description:
					'Наружный слой синего цвета производится из ПЭ 100-RC. Упрощает контроль повреждений трубы, а также предотвращает разрушение трубы, вызванное развитием царапин, задиров и иных повреждений внешней поверхности. 5',
				points: [
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '65%',
						left: '23%',
					},
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '57%',
						left: '68%',
					},
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '28.5%',
						left: '71%',
					},
				],
			},
		],
	},
	{
		button: 'Cпособ 3',
		slides: [
			{
				image: {
					src: 'construction-bg',
					alt: 'Конструкция',
				},
				description:
					'Наружный слой синего цвета производится из ПЭ 100-RC. Упрощает контроль повреждений трубы, а также предотвращает разрушение трубы, вызванное развитием царапин, задиров и иных повреждений внешней поверхности. 6',
				points: [
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '65%',
						left: '23%',
					},
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '57%',
						left: '68%',
					},
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '28.5%',
						left: '71%',
					},
				],
			},
			{
				image: {
					src: 'construction-bg',
					alt: 'Конструкция',
				},
				description:
					'Наружный слой синего цвета производится из ПЭ 100-RC. Упрощает контроль повреждений трубы, а также предотвращает разрушение трубы, вызванное развитием царапин, задиров и иных повреждений внешней поверхности. 7',
				points: [
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '45%',
						left: '23%',
					},
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '77%',
						left: '68%',
					},
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '18.5%',
						left: '71%',
					},
				],
			},
			{
				image: {
					src: 'construction-bg',
					alt: 'Конструкция',
				},
				description:
					'Наружный слой синего цвета производится из ПЭ 100-RC. Упрощает контроль повреждений трубы, а также предотвращает разрушение трубы, вызванное развитием царапин, задиров и иных повреждений внешней поверхности. 8',
				points: [
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '65%',
						left: '23%',
					},
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '57%',
						left: '68%',
					},
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '28.5%',
						left: '71%',
					},
				],
			},
		],
	},
]
</script>

<template>
	<main class="main">
		<Breadcrumbs :list="breadcrumbsList" />
		<PPHero />
		<ConstructionSection title="Конструкция" :slides="constructionSlides" />
		<ConstructionSection
			title="Способы соединения"
			:sliders="constructionSliders"
		/>
		<services-block
			:service="{
				title: 'Нанесение ППМ изоляции',
				href: '/piktube/services',
			}"
			:list-items="servicesList"
		/>
		<PPCatalog />
		<OwnCapacities />
		<SeoBlock />
		<ConsultationBlock />
	</main>
</template>

<style lang="scss"></style>
