<script setup lang="ts">
const breadcrumbsList = [
	{ title: 'Главная', href: '/' },
	{ title: 'Каталог', href: '/catalog' },
	{ title: 'Холодное водоснабжение', href: '/solution' },
]
const fitting = {
	content: {
		desc: 'Для надземной прокладки теплотрасс и промышленных сетей. Обеспечивает высокую механическую прочность и стойкость к внешним воздействиям.',
		measures: [
			{
				title: 'Толщина изоляции:',
				value: '10-100',
			},
			{
				title: 'd оболочки:',
				value: '30-140',
			},
			{
				title: 'Срок годности:',
				value: '20 лет',
			},
		],
	},
}
const servicesList = [
	{
		title: ['Нанесение ППМ изоляции на стальную трубу'],
		content: {
			desc: 'Для надземной прокладки теплотрасс и промышленных сетей. Обеспечивает высокую механическую прочность и стойкость к внешним воздействиям.',
			measures: [
				{
					title: 'Толщина изоляции:',
					value: '10-100',
				},
				{
					title: 'd оболочки:',
					value: '30-140',
				},
				{
					title: 'Срок годности:',
					value: '20 лет',
				},
			],
		},
	},
	{
		title: [
			'Нанесение ППМ изоляции на трубу напорную из полиэтилена повышенной термостойкости ПИКПАЙП PE-RT',
		],
		content: {
			desc: 'Для надземной прокладки теплотрасс и промышленных сетей. Обеспечивает высокую механическую прочность и стойкость к внешним воздействиям.',
			measures: [
				{
					title: 'Толщина изоляции:',
					value: '10-100',
				},
				{
					title: 'd оболочки:',
					value: '30-140',
				},
				{
					title: 'Срок годности:',
					value: '20 лет',
				},
			],
		},
	},
]
const constructionSlides = [
	{
		image: {
			src: 'construction-bg',
			alt: 'Конструкция',
		},
		description:
			'Наружный слой синего цвета производится из ПЭ 100-RC. Упрощает контроль повреждений трубы, а также предотвращает разрушение трубы, вызванное развитием царапин, задиров и иных повреждений внешней поверхности.',
		points: [
			{
				title: 'Описание краткое на пару предложений к картинке',
				top: '65%',
				left: '23%',
			},
			{
				title: 'Описание краткое на пару предложений к картинке',
				top: '57%',
				left: '68%',
			},
			{
				title: 'Описание краткое на пару предложений к картинке',
				top: '28.5%',
				left: '71%',
			},
		],
	},
	{
		image: {
			src: 'construction-bg',
			alt: 'Конструкция',
		},
		description:
			'Наружный слой синего цвета производится из ПЭ 100-RC. Упрощает контроль повреждений трубы, а также предотвращает разрушение трубы, вызванное развитием царапин, задиров и иных повреждений внешней поверхности. 1',
		points: [
			{
				title: 'Описание краткое на пару предложений к картинке',
				top: '45%',
				left: '23%',
			},
			{
				title: 'Описание краткое на пару предложений к картинке',
				top: '77%',
				left: '68%',
			},
			{
				title: 'Описание краткое на пару предложений к картинке',
				top: '18.5%',
				left: '71%',
			},
		],
	},
	{
		image: {
			src: 'construction-bg',
			alt: 'Конструкция',
		},
		description:
			'Наружный слой синего цвета производится из ПЭ 100-RC. Упрощает контроль повреждений трубы, а также предотвращает разрушение трубы, вызванное развитием царапин, задиров и иных повреждений внешней поверхности. 2',
		points: [
			{
				title: 'Описание краткое на пару предложений к картинке',
				top: '65%',
				left: '23%',
			},
			{
				title: 'Описание краткое на пару предложений к картинке',
				top: '57%',
				left: '68%',
			},
			{
				title: 'Описание краткое на пару предложений к картинке',
				top: '28.5%',
				left: '71%',
			},
		],
	},
]

const constructionSliders = [
	{
		button: 'Cпособ 1',
		slides: [
			{
				image: {
					src: 'construction-bg',
					alt: 'Конструкция',
				},
				description:
					'Наружный слой синего цвета производится из ПЭ 100-RC. Упрощает контроль повреждений трубы, а также предотвращает разрушение трубы, вызванное развитием царапин, задиров и иных повреждений внешней поверхности.',
				points: [
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '65%',
						left: '23%',
					},
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '57%',
						left: '68%',
					},
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '28.5%',
						left: '71%',
					},
				],
			},
			{
				image: {
					src: 'construction-bg',
					alt: 'Конструкция',
				},
				description:
					'Наружный слой синего цвета производится из ПЭ 100-RC. Упрощает контроль повреждений трубы, а также предотвращает разрушение трубы, вызванное развитием царапин, задиров и иных повреждений внешней поверхности. 1',
				points: [
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '45%',
						left: '23%',
					},
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '77%',
						left: '68%',
					},
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '18.5%',
						left: '71%',
					},
				],
			},
			{
				image: {
					src: 'construction-bg',
					alt: 'Конструкция',
				},
				description:
					'Наружный слой синего цвета производится из ПЭ 100-RC. Упрощает контроль повреждений трубы, а также предотвращает разрушение трубы, вызванное развитием царапин, задиров и иных повреждений внешней поверхности. 2',
				points: [
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '65%',
						left: '23%',
					},
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '57%',
						left: '68%',
					},
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '28.5%',
						left: '71%',
					},
				],
			},
		],
	},
	{
		button: 'Cпособ 2',
		slides: [
			{
				image: {
					src: 'construction-bg',
					alt: 'Конструкция',
				},
				description:
					'Наружный слой синего цвета производится из ПЭ 100-RC. Упрощает контроль повреждений трубы, а также предотвращает разрушение трубы, вызванное развитием царапин, задиров и иных повреждений внешней поверхности. 3',
				points: [
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '65%',
						left: '23%',
					},
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '57%',
						left: '68%',
					},
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '28.5%',
						left: '71%',
					},
				],
			},
			{
				image: {
					src: 'construction-bg',
					alt: 'Конструкция',
				},
				description:
					'Наружный слой синего цвета производится из ПЭ 100-RC. Упрощает контроль повреждений трубы, а также предотвращает разрушение трубы, вызванное развитием царапин, задиров и иных повреждений внешней поверхности. 4',
				points: [
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '45%',
						left: '23%',
					},
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '77%',
						left: '68%',
					},
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '18.5%',
						left: '71%',
					},
				],
			},
			{
				image: {
					src: 'construction-bg',
					alt: 'Конструкция',
				},
				description:
					'Наружный слой синего цвета производится из ПЭ 100-RC. Упрощает контроль повреждений трубы, а также предотвращает разрушение трубы, вызванное развитием царапин, задиров и иных повреждений внешней поверхности. 5',
				points: [
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '65%',
						left: '23%',
					},
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '57%',
						left: '68%',
					},
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '28.5%',
						left: '71%',
					},
				],
			},
		],
	},
	{
		button: 'Cпособ 3',
		slides: [
			{
				image: {
					src: 'construction-bg',
					alt: 'Конструкция',
				},
				description:
					'Наружный слой синего цвета производится из ПЭ 100-RC. Упрощает контроль повреждений трубы, а также предотвращает разрушение трубы, вызванное развитием царапин, задиров и иных повреждений внешней поверхности. 6',
				points: [
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '65%',
						left: '23%',
					},
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '57%',
						left: '68%',
					},
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '28.5%',
						left: '71%',
					},
				],
			},
			{
				image: {
					src: 'construction-bg',
					alt: 'Конструкция',
				},
				description:
					'Наружный слой синего цвета производится из ПЭ 100-RC. Упрощает контроль повреждений трубы, а также предотвращает разрушение трубы, вызванное развитием царапин, задиров и иных повреждений внешней поверхности. 7',
				points: [
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '45%',
						left: '23%',
					},
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '77%',
						left: '68%',
					},
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '18.5%',
						left: '71%',
					},
				],
			},
			{
				image: {
					src: 'construction-bg',
					alt: 'Конструкция',
				},
				description:
					'Наружный слой синего цвета производится из ПЭ 100-RC. Упрощает контроль повреждений трубы, а также предотвращает разрушение трубы, вызванное развитием царапин, задиров и иных повреждений внешней поверхности. 8',
				points: [
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '65%',
						left: '23%',
					},
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '57%',
						left: '68%',
					},
					{
						title: 'Описание краткое на пару предложений к картинке',
						top: '28.5%',
						left: '71%',
					},
				],
			},
		],
	},
]
const productTableSlides = [
	[
		{
			caption: {
				title: 'Однослойная труба ПИКПАЙП',
				image: {
					src: 'product-table/product-01',
					alt: 'Продукт',
				},
				href: '/piktube/catalog',
			},
			purpose: ['Холодное водоснабжение'],
			gost: ['ГОСТ 18599-2001', '(Изменение 1, 2);', 'ГОСТ Р 70628.2'],
			specification: ['ТУ 22.21.21-002-02986689', '-2018'],
			material: ['ПЭ100, ПЭ100+, ПЭ112,', 'ПЭ100RС'],
			diameter: [
				['63', '80', '110', '120', '130', '160'],
				['200', '240', '400', '800'],
			],
			sdr: [['6', '11', '13.6', '17', '21', '26', '41']],
			layersAmount: ['1'],
			additionalCharacteristic1: ['2'],
			additionalCharacteristic2: ['3'],
		},
		{
			caption: {
				title: 'Двухслойная труба ПИКПАЙП II',
				image: {
					src: 'product-table/product-01',
					alt: 'Продукт',
				},
				href: '/piktube/catalog',
			},
			purpose: ['Холодное водоснабжение'],
			gost: ['ГОСТ 18599-2001', '(Изменение 1, 2);', 'ГОСТ Р 70628.2'],
			specification: ['ТУ 22.21.21-002-02986689', '-2018'],
			material: ['ПЭ100, ПЭ100+, ПЭ112,', 'ПЭ100RС'],
			diameter: [
				['16', '21', '26', '41', '60', '80', '110'],
				['120', '130', '160', '200', '240'],
				['400', '800', '1200', '1600'],
			],
			sdr: [['9', '11', '13.6', '17', '21', '26', '41']],
			layersAmount: ['2'],
			additionalCharacteristic1: ['3'],
			additionalCharacteristic2: ['4'],
		},
		{
			caption: {
				title: 'Трехслойная труба ПИКПАЙП III',
				image: {
					src: 'product-table/product-01',
					alt: 'Продукт',
				},
				href: '/piktube/catalog',
			},
			purpose: ['Холодное водоснабжение'],
			gost: ['ГОСТ 18599-2001', '(Изменение 1, 2);', 'ГОСТ Р 70628.2'],
			specification: ['ТУ 22.21.21-002-02986689', '-2018'],
			material: ['ПЭ100, ПЭ100+, ПЭ112,', 'ПЭ100RС'],
			diameter: [
				['16', '21', '26', '41', '60', '80', '110'],
				['120', '130', '160', '200', '240'],
				['400', '800', '1200', '1600'],
			],
			sdr: [['9', '11', '13.6', '17', '21', '26', '41']],
			layersAmount: ['3'],
			additionalCharacteristic1: ['4'],
			additionalCharacteristic2: ['5'],
		},
		{
			caption: {
				title: 'Трехслойная труба ПИКПАЙП ХАРД',
				image: {
					src: 'product-table/product-01',
					alt: 'Продукт',
				},
				href: '/piktube/catalog',
			},
			purpose: ['Холодное водоснабжение'],
			gost: ['ГОСТ 18599-2001', '(Изменение 1, 2);', 'ГОСТ Р 70628.2'],
			specification: ['ТУ 22.21.21-002-02986689', '-2018'],
			material: ['ПЭ100, ПЭ100+, ПЭ112,', 'ПЭ100RС'],
			diameter: [
				['16', '21', '26', '41', '60', '80', '110'],
				['120', '130', '160', '200', '240'],
				['400', '800', '1200', '1600'],
			],
			sdr: [['9', '11', '13.6', '17', '21', '26', '41']],
			layersAmount: ['3'],
			additionalCharacteristic1: ['4'],
			additionalCharacteristic2: ['5'],
		},
		{
			caption: {
				title: 'ПИКПАЙП с защитным покрытием COVER',
				image: {
					src: 'product-table/product-01',
					alt: 'Продукт',
				},
				href: '/piktube/catalog',
			},
			purpose: ['Холодное водоснабжение'],
			gost: ['ГОСТ 18599-2001', '(Изменение 1, 2);', 'ГОСТ Р 70628.2'],
			specification: ['ТУ 22.21.21-002-02986689', '-2018'],
			material: ['ПЭ100, ПЭ100+, ПЭ112,', 'ПЭ100RС'],
			diameter: [
				['16', '21', '26', '41', '60', '80', '110'],
				['120', '130', '160', '200', '240'],
				['400', '800', '1200', '1600'],
			],
			sdr: [['9', '11', '13.6', '17', '21', '26', '41']],
			layersAmount: ['3'],
			additionalCharacteristic1: ['5'],
			additionalCharacteristic2: ['6'],
		},
	],
	[
		{
			caption: {
				title: 'Однослойная труба ПИКПАЙП (1)',
				image: {
					src: 'product-table/product-01',
					alt: 'Продукт',
				},
				href: '/piktube/catalog',
			},
			purpose: ['Холодное водоснабжение'],
			gost: ['ГОСТ 18599-2001', '(Изменение 1, 2);', 'ГОСТ Р 70628.2'],
			specification: ['ТУ 22.21.21-002-02986689', '-2018'],
			material: ['ПЭ100, ПЭ100+, ПЭ112,', 'ПЭ100RС'],
			diameter: [
				['63', '80', '110', '120', '130', '160'],
				['200', '240', '400', '800'],
			],
			sdr: [['6', '11', '13.6', '17', '21', '26', '41']],
			layersAmount: ['1'],
			additionalCharacteristic1: ['2'],
			additionalCharacteristic2: ['3'],
		},
		{
			caption: {
				title: 'Двухслойная труба ПИКПАЙП II (1)',
				image: {
					src: 'product-table/product-01',
					alt: 'Продукт',
				},
				href: '/piktube/catalog',
			},
			purpose: ['Холодное водоснабжение'],
			gost: ['ГОСТ 18599-2001', '(Изменение 1, 2);', 'ГОСТ Р 70628.2'],
			specification: ['ТУ 22.21.21-002-02986689', '-2018'],
			material: ['ПЭ100, ПЭ100+, ПЭ112,', 'ПЭ100RС'],
			diameter: [
				['16', '21', '26', '41', '60', '80', '110'],
				['120', '130', '160', '200', '240'],
				['400', '800', '1200', '1600'],
			],
			sdr: [['9', '11', '13.6', '17', '21', '26', '41']],
			layersAmount: ['2'],
			additionalCharacteristic1: ['3'],
			additionalCharacteristic2: ['4'],
		},
		{
			caption: {
				title: 'Трехслойная труба ПИКПАЙП III (1)',
				image: {
					src: 'product-table/product-01',
					alt: 'Продукт',
				},
				href: '/piktube/catalog',
			},
			purpose: ['Холодное водоснабжение'],
			gost: ['ГОСТ 18599-2001', '(Изменение 1, 2);', 'ГОСТ Р 70628.2'],
			specification: ['ТУ 22.21.21-002-02986689', '-2018'],
			material: ['ПЭ100, ПЭ100+, ПЭ112,', 'ПЭ100RС'],
			diameter: [
				['16', '21', '26', '41', '60', '80', '110'],
				['120', '130', '160', '200', '240'],
				['400', '800', '1200', '1600'],
			],
			sdr: [['9', '11', '13.6', '17', '21', '26', '41']],
			layersAmount: ['3'],
			additionalCharacteristic1: ['4'],
			additionalCharacteristic2: ['5'],
		},
		{
			caption: {
				title: 'Трехслойная труба ПИКПАЙП ХАРД (1)',
				image: {
					src: 'product-table/product-01',
					alt: 'Продукт',
				},
				href: '/piktube/catalog',
			},
			purpose: ['Холодное водоснабжение'],
			gost: ['ГОСТ 18599-2001', '(Изменение 1, 2);', 'ГОСТ Р 70628.2'],
			specification: ['ТУ 22.21.21-002-02986689', '-2018'],
			material: ['ПЭ100, ПЭ100+, ПЭ112,', 'ПЭ100RС'],
			diameter: [
				['16', '21', '26', '41', '60', '80', '110'],
				['120', '130', '160', '200', '240'],
				['400', '800', '1200', '1600'],
			],
			sdr: [['9', '11', '13.6', '17', '21', '26', '41']],
			layersAmount: ['3'],
			additionalCharacteristic1: ['4'],
			additionalCharacteristic2: ['5'],
		},
		{
			caption: {
				title: 'ПИКПАЙП с защитным покрытием COVER (1)',
				image: {
					src: 'product-table/product-01',
					alt: 'Продукт',
				},
				href: '/piktube/catalog',
			},
			purpose: ['Холодное водоснабжение'],
			gost: ['ГОСТ 18599-2001', '(Изменение 1, 2);', 'ГОСТ Р 70628.2'],
			specification: ['ТУ 22.21.21-002-02986689', '-2018'],
			material: ['ПЭ100, ПЭ100+, ПЭ112,', 'ПЭ100RС'],
			diameter: [
				['16', '21', '26', '41', '60', '80', '110'],
				['120', '130', '160', '200', '240'],
				['400', '800', '1200', '1600'],
			],
			sdr: [['9', '11', '13.6', '17', '21', '26', '41']],
			layersAmount: ['3'],
			additionalCharacteristic1: ['5'],
			additionalCharacteristic2: ['6'],
		},
	],
]
</script>

<template>
	<main class="main">
		<Breadcrumbs :list="breadcrumbsList" />
		<HeroVideo />
		<SHero />
		<TableSection title="Варианты труб" :slides="productTableSlides" />
		<FittingBlock :list-item="fitting" :is-big-btn="true" title="Фитинги" />
		<ConstructionSection title="Конструкция" :slides="constructionSlides" />
		<ConstructionSection
			title="Способы соединения"
			:sliders="constructionSliders"
		/>
		<services-block
			:service="{
				title: 'Нанесение ППМ изоляции',
				href: '/piktube/services',
			}"
			:list-items="servicesList"
		/>
		<PPCatalog />
		<OwnCapacities />
		<SeoBlock />
		<ConsultationBlock />
		<ActionsPopup />
	</main>
	<DocumentationModal />
	<OrderModal />
</template>

<style lang="scss"></style>
