<script setup lang="ts">
import type { DocumentSlideProps } from '~/components/slides/DocumentSlide.vue'

interface ProListSection {
	title: string
	slides: DocumentSlideProps[]
}

interface ProListItem {
	title: string
	sections: ProListSection[]
	sliderMode: 'compact' | 'wide'
	showButtons?: boolean
}

interface ProListProps {
	items?: ProListItem[]
}

const props = defineProps<ProListProps>()

const ProList: ProListItem[] = [
	{
		title: 'Альбомы проектных решений (по запросу)',
		sections: [
			{
				title: 'Альбомы проектных решений (по запросу)',
				slides: [
					{
						text: ['Альбом проектных', 'решений №1'],
						size: '10',
					},
					{
						text: ['Альбом проектных', 'решений №2'],
						size: '10',
					},
					{
						text: ['Альбом проектных', 'решений №3'],
						size: '10',
					},
					{
						text: ['Альбом проектных', 'решений №4'],
						size: '10',
					},
					{
						text: ['Альбом проектных', 'решений №5'],
						size: '10',
					},
					{
						text: ['Альбом проектных', 'решений №6'],
						size: '10',
					},
				],
			},
		],
		sliderMode: 'wide',
		showButtons: false, // Без кнопок - показывается только слайдер
	},
	{
		title: 'Прайс листы',
		sections: [
			{
				title: 'Водоснабжение',
				slides: [
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП'],
						size: '10',
					},
				],
			},
			{
				title: 'Водоотведение',
				slides: [
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 1'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 1'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 1'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 1'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 1'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 1'],
						size: '10',
					},
				],
			},
			{
				title: 'Газораспределение',
				slides: [
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 2'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 2'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 2'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 2'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 2'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 2'],
						size: '10',
					},
				],
			},
			{
				title: 'Защита кабеля',
				slides: [
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 3'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 3'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 3'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 3'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 3'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 3'],
						size: '10',
					},
				],
			},
			{
				title: 'Изоляция в нефтегазовой отрасли',
				slides: [
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 4'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 4'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 4'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 4'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 4'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 4'],
						size: '10',
					},
				],
			},
			{
				title: 'Стальные трубы в изоляции',
				slides: [
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 5'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 5'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 5'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 5'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 5'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 5'],
						size: '10',
					},
				],
			},
			{
				title: 'Полиэтиленовые трубы',
				slides: [
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 6'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 6'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 6'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 6'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 6'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 6'],
						size: '10',
					},
				],
			},
			{
				title: 'Фасонные изделия в изоляции',
				slides: [
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 7'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 7'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 7'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 7'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 7'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 7'],
						size: '10',
					},
				],
			},
		],
		sliderMode: 'wide',
		showButtons: true,
	},
	{
		title: 'Сертификаты',
		sections: [
			{
				title: 'Водоснабжение',
				slides: [
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП'],
						size: '10',
					},
				],
			},
			{
				title: 'Водоотведение',
				slides: [
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 1'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 1'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 1'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 1'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 1'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 1'],
						size: '10',
					},
				],
			},
			{
				title: 'Газораспределение',
				slides: [
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 2'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 2'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 2'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 2'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 2'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 2'],
						size: '10',
					},
				],
			},
			{
				title: 'Защита кабеля',
				slides: [
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 3'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 3'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 3'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 3'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 3'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 3'],
						size: '10',
					},
				],
			},
			{
				title: 'Изоляция в нефтегазовой отрасли',
				slides: [
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 4'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 4'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 4'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 4'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 4'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 4'],
						size: '10',
					},
				],
			},
			{
				title: 'Стальные трубы в изоляции',
				slides: [
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 5'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 5'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 5'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 5'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 5'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 5'],
						size: '10',
					},
				],
			},
			{
				title: 'Полиэтиленовые трубы',
				slides: [
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 6'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 6'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 6'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 6'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 6'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 6'],
						size: '10',
					},
				],
			},
			{
				title: 'Фасонные изделия в изоляции',
				slides: [
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 7'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 7'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 7'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 7'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 7'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 7'],
						size: '10',
					},
				],
			},
		],
		sliderMode: 'wide',
		showButtons: true,
	},
	{
		title: 'ГОСТы',
		sections: [
			{
				title: 'Водоснабжение',
				slides: [
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП'],
						size: '10',
					},
				],
			},
			{
				title: 'Водоотведение',
				slides: [
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 1'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 1'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 1'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 1'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 1'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 1'],
						size: '10',
					},
				],
			},
			{
				title: 'Газораспределение',
				slides: [
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 2'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 2'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 2'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 2'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 2'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 2'],
						size: '10',
					},
				],
			},
			{
				title: 'Защита кабеля',
				slides: [
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 3'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 3'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 3'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 3'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 3'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 3'],
						size: '10',
					},
				],
			},
			{
				title: 'Изоляция в нефтегазовой отрасли',
				slides: [
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 4'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 4'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 4'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 4'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 4'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 4'],
						size: '10',
					},
				],
			},
			{
				title: 'Стальные трубы в изоляции',
				slides: [
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 5'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 5'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 5'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 5'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 5'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 5'],
						size: '10',
					},
				],
			},
			{
				title: 'Полиэтиленовые трубы',
				slides: [
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 6'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 6'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 6'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 6'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 6'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 6'],
						size: '10',
					},
				],
			},
			{
				title: 'Фасонные изделия в изоляции',
				slides: [
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 7'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 7'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 7'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 7'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 7'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 7'],
						size: '10',
					},
				],
			},
		],
		sliderMode: 'wide',
		showButtons: true,
	},
	{
		title: 'СНИПы',
		sections: [
			{
				title: 'Водоснабжение',
				slides: [
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП'],
						size: '10',
					},
				],
			},
			{
				title: 'Водоотведение',
				slides: [
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 1'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 1'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 1'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 1'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 1'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 1'],
						size: '10',
					},
				],
			},
			{
				title: 'Газораспределение',
				slides: [
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 2'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 2'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 2'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 2'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 2'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 2'],
						size: '10',
					},
				],
			},
			{
				title: 'Защита кабеля',
				slides: [
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 3'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 3'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 3'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 3'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 3'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 3'],
						size: '10',
					},
				],
			},
			{
				title: 'Изоляция в нефтегазовой отрасли',
				slides: [
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 4'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 4'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 4'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 4'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 4'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 4'],
						size: '10',
					},
				],
			},
			{
				title: 'Стальные трубы в изоляции',
				slides: [
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 5'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 5'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 5'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 5'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 5'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 5'],
						size: '10',
					},
				],
			},
			{
				title: 'Полиэтиленовые трубы',
				slides: [
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 6'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 6'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 6'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 6'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 6'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 6'],
						size: '10',
					},
				],
			},
			{
				title: 'Фасонные изделия в изоляции',
				slides: [
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 7'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 7'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 7'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 7'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 7'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 7'],
						size: '10',
					},
				],
			},
		],
		sliderMode: 'wide',
		showButtons: true,
	},
	{
		title: 'Инструкции по монтажу',
		sections: [
			{
				title: 'Водоснабжение',
				slides: [
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП'],
						size: '10',
					},
				],
			},
			{
				title: 'Водоотведение',
				slides: [
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 1'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 1'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 1'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 1'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 1'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 1'],
						size: '10',
					},
				],
			},
			{
				title: 'Газораспределение',
				slides: [
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 2'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 2'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 2'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 2'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 2'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 2'],
						size: '10',
					},
				],
			},
			{
				title: 'Защита кабеля',
				slides: [
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 3'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 3'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 3'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 3'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 3'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 3'],
						size: '10',
					},
				],
			},
			{
				title: 'Изоляция в нефтегазовой отрасли',
				slides: [
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 4'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 4'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 4'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 4'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 4'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 4'],
						size: '10',
					},
				],
			},
			{
				title: 'Стальные трубы в изоляции',
				slides: [
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 5'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 5'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 5'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 5'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 5'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 5'],
						size: '10',
					},
				],
			},
			{
				title: 'Полиэтиленовые трубы',
				slides: [
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 6'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 6'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 6'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 6'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 6'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 6'],
						size: '10',
					},
				],
			},
			{
				title: 'Фасонные изделия в изоляции',
				slides: [
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 7'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 7'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 7'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 7'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 7'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 7'],
						size: '10',
					},
				],
			},
		],
		sliderMode: 'wide',
		showButtons: true,
	},
	{
		title: 'Схемы соединений',
		sections: [
			{
				title: 'Водоснабжение',
				slides: [
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП'],
						size: '10',
					},
				],
			},
			{
				title: 'Водоотведение',
				slides: [
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 1'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 1'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 1'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 1'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 1'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 1'],
						size: '10',
					},
				],
			},
			{
				title: 'Газораспределение',
				slides: [
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 2'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 2'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 2'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 2'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 2'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 2'],
						size: '10',
					},
				],
			},
			{
				title: 'Защита кабеля',
				slides: [
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 3'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 3'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 3'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 3'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 3'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 3'],
						size: '10',
					},
				],
			},
			{
				title: 'Изоляция в нефтегазовой отрасли',
				slides: [
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 4'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 4'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 4'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 4'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 4'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 4'],
						size: '10',
					},
				],
			},
			{
				title: 'Стальные трубы в изоляции',
				slides: [
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 5'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 5'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 5'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 5'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 5'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 5'],
						size: '10',
					},
				],
			},
			{
				title: 'Полиэтиленовые трубы',
				slides: [
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 6'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 6'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 6'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 6'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 6'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 6'],
						size: '10',
					},
				],
			},
			{
				title: 'Фасонные изделия в изоляции',
				slides: [
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 7'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 7'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 7'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 7'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 7'],
						size: '10',
					},
					{
						text: ['Прайс на однослойную трубу ПНД ', 'ПИКПАЙП 7'],
						size: '10',
					},
				],
			},
		],
		sliderMode: 'wide',
		showButtons: true,
	},
]

const listItems = computed(() =>
	props.items && props.items.length ? props.items : ProList,
)
</script>

<template>
	<div class="pro-list-wrap">
		<div class="container">
			<div class="pro-list">
				<div
					v-for="(item, index) in listItems"
					:key="index"
					class="pro-list__item"
				>
					<ProItem v-bind="item" />
				</div>
			</div>
		</div>
	</div>
</template>

<style lang="scss">
.pro-list-wrap {
	margin-bottom: 80px;
	@include ultrahd {
		margin-bottom: 120px;
	}
}
.pro-list {
	&__item {
		padding: var(--space-md) 0;
		border-top: 1px solid var(--graphic-main);
		@include ultrahd {
			padding: 50px 0;
		}
		&:last-child {
			border-bottom: 1px solid var(--graphic-main);
		}

		.section-dropdown_active .section-dropdown__content {
			padding-top: var(--space-xl);
		}
	}
}
</style>
